app/Client.php

    static function getAllClients($page = 1, $perPage = 15, $searchField = ''){
      $startAt = $perPage * ($page - 1);
      if($searchField == ''){
        $records =  DB::table('clients')->get();
        $data['totalPages'] = ceil(count($records) / $perPage);
        $data['result'] = DB::table('clients')
        ->offset($startAt)
        ->limit($perPage)->get();
      }else{
        $records =  DB::table('clients')->orWhere('name', 'like' , '%'. $searchField .'%')->get();
        $data['totalPages'] = ceil(count($records) / $perPage);
        $data['result'] = DB::table('clients')
        ->orWhere('name' , 'like' , '%'. $searchField .'%')
        ->offset($startAt)
        ->limit($perPage)->get();
---
select * from `clients`
select * from `clients` limit 15 offset 0
select * from `clients` where `name` like '%m%'
select * from `clients` where `name` like '%m%' limit 15 offset 0