app/Config.php

select * from `configs`
---
    static function getConfig(){
      return  DB::table('configs')->get();;

update `configs` set `value` = '100' where `name` = 'consumption_value_step'
---
    static function updateConfig($name, $value){
      DB::table('configs')
        ->Where('name' , $name)
        ->update(
            ['value' => $value]
        );