app/Consumption.php

    static function getAllConsumptions($page = 1, $perPage = 15, $month = 1 ,$year = 2020, $searchField = ''){

      $counters = Counter::getAllCounters($page, $perPage, $searchField);
      $data["result"]  = array();
      $data['totalPages'] = $counters['totalPages'];
      foreach($counters['result'] as $d){
        if($month > 1){
          $lastconsumption = DB::table('consumptions')
          ->Where('year' , $year)
          ->Where('month' , ($month - 1))
          ->Where('counter_id' , $d->counterId)
          ->get();

          $thisconsumption = DB::table('consumptions')
          ->Where('year' , $year)
          ->Where('month' , $month)
          ->Where('counter_id' , $d->counterId)
          ->get();
        }else{
          $lastconsumption = DB::table('consumptions')
          ->Where('year' , ($year - 1))
          ->Where('month' , 12)
          ->Where('counter_id' , $d->counterId)
          ->get();

          $thisconsumption = DB::table('consumptions')
          ->Where('year' , $year)
          ->Where('month' , $month)
          ->Where('counter_id' , $d->counterId)
          ->get();
---
select * from `consumptions` where `year` = 2021 and `month` = 2 and `counter_id` = '1'
select * from `consumptions` where `year` = 2021 and `month` = 3 and `counter_id` = '1'
select * from `consumptions` where `year` = 2019 and `month` = 12 and `counter_id` = 9
select * from `consumptions` where `year` is null and `month` is null and `counter_id` = 9

    static function getConsumptionByCounterMonthYear($counter_id, $month , $year){
      $consumption = DB::table('consumptions')
      ->where([['counter_id','=', $counter_id], ['month','=', $month], ['year','=', $year]])
      ->get();
---
select * from `consumptions` where (`counter_id` = '28' and `month` = '8' and `counter_id` = '2021')

    static function AddConsumption($counter_id, $month , $year , $value){
     return  DB::table('consumptions')->insertGetId(
            [
              'counter_id' => $counter_id ,
              'month' => $month ,
              'year' => $year ,
              'value' => $value,
            ]
        );
---
insert into `consumptions` (`counter_id`, `month`, `year`, `value`) values ('28', '8', '2021', '57')

    static function updateConsumption($value, $consumption_id){
      DB::table('consumptions')
        ->Where('id' , $consumption_id)
        ->update(
            ['value' => $value]
        );
---
update `consumptions` set `value` = '87' where `id` = 3637