app/Counter.php

    static function getAllCounters($page = 1, $perPage = 15, $searchField = ''){
      $startAt = $perPage * ($page - 1);
      if($searchField == ''){
        $records =  DB::table('counters')->get();
        $data['totalPages'] = ceil(count($records) / $perPage);
        $data['result'] = DB::table('counters')
        ->select('clients.id as clientId', 'counters.id as counterId', 'clients.name', 'clients.cin', 'counters.id', 'counters.number', 'counters.itial_consumption', 'counters.start_date', 'counters.active', 'counters.end_date')
        ->join('clients', 'clients.id', '=', 'counters.client_id')
        ->offset($startAt)
        ->limit($perPage)->get();
      }else{
        $records =  DB::table('counters')->join('clients', 'clients.id', '=', 'counters.client_id')->orWhere('name', 'like' , '%'. $searchField .'%')->get();
        $data['totalPages'] = ceil(count($records) / $perPage);
        $data['result'] = DB::table('counters')
        ->select('clients.id as clientId', 'counters.id as counterId', 'clients.name', 'clients.cin','counters.id', 'counters.number', 'counters.itial_consumption', 'counters.start_date', 'counters.active', 'counters.end_date')
        ->join('clients', 'clients.id', '=', 'counters.client_id')
        ->orWhere('clients.name' , 'like' , '%'. $searchField .'%')
        ->orWhere('counters.number' , 'like' , '%'. $searchField .'%')
        ->offset($startAt)
        ->limit($perPage)->get();
---
select * from `counters`
select `clients`.`id` as `clientId`, `counters`.`id` as `counterId`, `clients`.`name`, `clients`.`cin`, `counters`.`id`, `counters`.`number`, `counters`.`itial_consumption`, `counters`.`start_date`, `counters`.`active`, `counters`.`end_date` from `counters` inner join `clients` on `clients`.`id` = `counters`.`client_id` limit 15 offset 0
select * from `counters` inner join `clients` on `clients`.`id` = `counters`.`client_id` where `name` like '%Mustapha%'
select `clients`.`id` as `clientId`, `counters`.`id` as `counterId`, `clients`.`name`, `clients`.`cin`, `counters`.`id`, `counters`.`number`, `counters`.`itial_consumption`, `counters`.`start_date`, `counters`.`active`, `counters`.`end_date` from `counters` inner join `clients` on `clients`.`id` = `counters`.`client_id` where `clients`.`name` like '%Mustapha%' or `counters`.`number` like '%Mustapha%' limit 15 offset 0