app/Counter.php

select * from `counters` inner join `clients` on `clients`.`id` = `counters`.`client_id` limit 15 offset 0
---
    static function getAllCounters($page = 1, $perPage = 15, $searchField = ''){
      $startAt = $perPage * ($page - 1);
      if($searchField == ''){
        $records =  DB::table('counters')->get();
        $data['totalPages'] = ceil(count($records) / $perPage);
        $data['result'] = DB::table('counters')
        ->join('clients', 'clients.id', '=', 'counters.client_id')
        ->offset($startAt)
        ->limit($perPage)->get();