app/Invoice.php

select * from `clients` inner join `counters` on `clients`.`id` = `counters`.`client_id` inner join `consumptions` on `counters`.`id` = `consumptions`.`counter_id` inner join `invoices` on `consumptions`.`id` = `invoices`.`consumption_id`
select `clients`.`cin`, `clients`.`name`, `clients`.`subscription_fees`, `counters`.`number` as `cnumber`, `consumptions`.`month`, `consumptions`.`year`, `consumptions`.`value`, `invoices`.`id`, `invoices`.`number` as `inumber`, `invoices`.`price`, `invoices`.`status` from `clients` inner join `counters` on `clients`.`id` = `counters`.`client_id` inner join `consumptions` on `counters`.`id` = `consumptions`.`counter_id` inner join `invoices` on `consumptions`.`id` = `invoices`.`consumption_id` limit 30 offset 0
select `clients`.`cin`, `clients`.`name`, `clients`.`subscription_fees`, `counters`.`number` as `cnumber`, `consumptions`.`month`, `consumptions`.`year`, `consumptions`.`value`, `invoices`.`id`, `invoices`.`number` as `inumber`, `invoices`.`price`, `invoices`.`status` from `clients` inner join `counters` on `clients`.`id` = `counters`.`client_id` inner join `consumptions` on `counters`.`id` = `consumptions`.`counter_id` inner join `invoices` on `consumptions`.`id` = `invoices`.`consumption_id` order by CAST(counters.number AS int) limit 15 offset 0
---
      static function getAllInvoices($page = 1, $perPage = 15, $searchField = ''){
        $startAt = $perPage * ($page - 1);
        if($searchField == ''){
          $records =  DB::table('clients')
                        ->join('counters', 'clients.id', '=', 'counters.client_id')
                        ->join('consumptions', 'counters.id', '=', 'consumptions.counter_id')
                        ->join('invoices', 'consumptions.id', '=', 'invoices.consumption_id')->get();

                        $data['totalPages'] = ceil(count($records) / $perPage);

                        $data['result'] = DB::table('clients')
                        ->join('counters', 'clients.id', '=', 'counters.client_id')
                        ->join('consumptions', 'counters.id', '=', 'consumptions.counter_id')
                        ->join('invoices', 'consumptions.id', '=', 'invoices.consumption_id')
                        ->offset($startAt)
                        ->limit($perPage)
                        ->select('clients.cin', 'clients.name', 'clients.subscription_fees','counters.number as cnumber' , 'consumptions.month', 'consumptions.year', 'consumptions.value', 'invoices.id', 'invoices.number as inumber', 'invoices.price', 'invoices.status')->get();

        }else{
          $records =  DB::table('clients')
                        ->join('counters', 'clients.id', '=', 'counters.client_id')
                        ->join('consumptions', 'counters.id', '=', 'consumptions.counter_id')
                        ->join('invoices', 'consumptions.id', '=', 'invoices.consumption_id')->get();

select * from `clients` inner join `counters` on `clients`.`id` = `counters`.`client_id` inner join `consumptions` on `counters`.`id` = `consumptions`.`counter_id` inner join `invoices` on `consumptions`.`id` = `invoices`.`consumption_id`
select `clients`.`cin`, `clients`.`name`, `clients`.`subscription_fees`, `counters`.`number` as `cnumber`, `consumptions`.`month`, `consumptions`.`year`, `consumptions`.`value`, `invoices`.`id`, `invoices`.`number` as `inumber`, `invoices`.`price`, `invoices`.`status` from `clients` inner join `counters` on `clients`.`id` = `counters`.`client_id` inner join `consumptions` on `counters`.`id` = `consumptions`.`counter_id` inner join `invoices` on `consumptions`.`id` = `invoices`.`consumption_id` limit 30 offset 30
---
      static function getAllUnpaidInvoices($page = 1, $perPage = 30){
        $startAt = $perPage * ($page - 1);

        $records =  DB::table('clients')
        ->join('counters', 'clients.id', '=', 'counters.client_id')
        ->join('consumptions', 'counters.id', '=', 'consumptions.counter_id')
        ->join('invoices', 'consumptions.id', '=', 'invoices.consumption_id')->get();

        $data['totalPages'] = ceil(count($records) / $perPage);

        $data['result'] = DB::table('clients')
        ->join('counters', 'clients.id', '=', 'counters.client_id')
        ->join('consumptions', 'counters.id', '=', 'consumptions.counter_id')
        ->join('invoices', 'consumptions.id', '=', 'invoices.consumption_id')
        ->offset($startAt)
        ->limit($perPage)
        ->select('clients.cin', 'clients.name', 'clients.subscription_fees','counters.number as cnumber' , 'consumptions.month', 'consumptions.year', 'consumptions.value', 'invoices.id', 'invoices.number as inumber', 'invoices.price', 'invoices.status')->get();

select * from `clients` inner join `counters` on `clients`.`id` = `counters`.`client_id` inner join `consumptions` on `counters`.`id` = `consumptions`.`counter_id` inner join `invoices` on `consumptions`.`id` = `invoices`.`consumption_id` where (`invoices`.`month_consumption` = '1' and `invoices`.`year_consumption` = '2021' and `invoices`.`status` = '1' and `clients`.`name` like '%حسن%' and `invoices`.`number` = 'FC15912021')
select `clients`.`cin`, `clients`.`name`, `clients`.`subscription_fees`, `counters`.`number` as `cnumber`, `consumptions`.`month`, `consumptions`.`year`, `consumptions`.`value`, `invoices`.`id`, `invoices`.`number` as `inumber`, `invoices`.`price`, `invoices`.`status` from `clients` inner join `counters` on `clients`.`id` = `counters`.`client_id` inner join `consumptions` on `counters`.`id` = `consumptions`.`counter_id` inner join `invoices` on `consumptions`.`id` = `invoices`.`consumption_id` where (`invoices`.`month_consumption` = '1' and `invoices`.`year_consumption` = '2021' and `invoices`.`status` = '1' and `clients`.`name` like '%حسن%' and `invoices`.`number` = 'FC15912021') limit 15 offset 0
---
      static function getInvoicesBy($page = 1, $year , $month , $client_name, $counter_number, $invoice_number, $type_invoice){
        $perPage = 15;
        $startAt = $perPage * ($page - 1);
        $orWhere = [];
        $where = [
            ['invoices.month_consumption', "=", $month ],
            ['invoices.year_consumption', "=", $year ],
            ["invoices.status", "=", $type_invoice  ],
          ];
        if($client_name != ''){
          $where[] = ["clients.name","like", "%{$client_name}%" ];
        }
        if($counter_number != ''){
          $where[] = ["counters.number", "=",  $counter_number  ];
        }
        if($invoice_number != ''){
          $where[] = ["invoices.number", "=",  $invoice_number  ];
        }
        $records =  DB::table('clients')
                      ->join('counters', 'clients.id', '=', 'counters.client_id')
                      ->join('consumptions', 'counters.id', '=', 'consumptions.counter_id')
                      ->where($where)
                      ->join('invoices', 'consumptions.id', '=', 'invoices.consumption_id')->get();
        $data['totalPages'] = ceil(count($records) / $perPage);
        $data['result'] = DB::table('clients')
                      ->join('counters', 'clients.id', '=', 'counters.client_id')
                      ->join('consumptions', 'counters.id', '=', 'consumptions.counter_id')
                      ->join('invoices', 'consumptions.id', '=', 'invoices.consumption_id')
                      ->where($where)
                      ->offset($startAt)
                      ->limit($perPage)
                      ->select('clients.cin', 'clients.name', 'clients.subscription_fees','counters.number as cnumber' , 'consumptions.month', 'consumptions.year', 'consumptions.value', 'invoices.id', 'invoices.number as inumber', 'invoices.price', 'invoices.status')->get();