app/Payment.php

    static function getAllPayments($page = 1, $perPage = 15, $searchField = ''){
        $startAt = $perPage * ($page - 1);
        if($searchField == ''){
          $records =  DB::table('clients')
                        ->join('counters', 'clients.id', '=', 'counters.client_id')
                        ->join('consumptions', 'counters.id', '=', 'consumptions.counter_id')
                        ->join('invoices', 'consumptions.id', '=', 'invoices.consumption_id')
                        ->join('invo_payments', 'invoices.id', '=', 'invo_payments.invoice_id')
                        ->join('payments', 'invo_payments.payment_id', '=', 'payments.id')->get();

                        $data['totalPages'] = ceil(count($records) / $perPage);

                        $data['result'] = DB::table('clients')
                        ->join('counters', 'clients.id', '=', 'counters.client_id')
                        ->join('consumptions', 'counters.id', '=', 'consumptions.counter_id')
                        ->join('invoices', 'consumptions.id', '=', 'invoices.consumption_id')
                        ->join('invo_payments', 'invoices.id', '=', 'invo_payments.invoice_id')
                        ->join('payments', 'invo_payments.payment_id', '=', 'payments.id')
                        ->offset($startAt)
                        ->limit($perPage)
                        ->select('clients.cin', 'clients.name', 'clients.subscription_fees','counters.number as cnumber' , 'consumptions.month', 'consumptions.year', 'consumptions.value', 'invoices.id', 'invoices.number as inumber', 'invoices.price', 'invoices.status')->get();
---
select * from `clients` inner join `counters` on `clients`.`id` = `counters`.`client_id` inner join `consumptions` on `counters`.`id` = `consumptions`.`counter_id` inner join `invoices` on `consumptions`.`id` = `invoices`.`consumption_id` inner join `invo_payments` on `invoices`.`id` = `invo_payments`.`invoice_id` inner join `payments` on `invo_payments`.`payment_id` = `payments`.`id`
select `clients`.`cin`, `clients`.`name`, `clients`.`subscription_fees`, `counters`.`number` as `cnumber`, `consumptions`.`month`, `consumptions`.`year`, `consumptions`.`value`, `invoices`.`id`, `invoices`.`number` as `inumber`, `invoices`.`price`, `invoices`.`status` from `clients` inner join `counters` on `clients`.`id` = `counters`.`client_id` inner join `consumptions` on `counters`.`id` = `consumptions`.`counter_id` inner join `invoices` on `consumptions`.`id` = `invoices`.`consumption_id` inner join `invo_payments` on `invoices`.`id` = `invo_payments`.`invoice_id` inner join `payments` on `invo_payments`.`payment_id` = `payments`.`id` limit 15 offset 0

    static function getPaymentById($payment_id){
      $records =  DB::table('clients')
          ->join('counters', 'clients.id', '=', 'counters.client_id')
          ->join('consumptions', 'counters.id', '=', 'consumptions.counter_id')
          ->join('invoices', 'consumptions.id', '=', 'invoices.consumption_id')
          ->join('invo_payments', 'invoices.id', '=', 'invo_payments.invoice_id')
          ->join('payments', 'invo_payments.payment_id', '=', 'payments.id')
          ->where('payments.id' , $payment_id)
          ->select('clients.cin', 'clients.name','clients.address','clients.phone', 'clients.subscription_fees','counters.number as cnumber' , 'consumptions.month', 'consumptions.year', 'consumptions.value', 'invoices.id', 'invoices.number as inumber', 'invoices.price', 'payments.total_price', 'payments.pinality_date', 'payments.pinality_price')->get();
---
select `clients`.`cin`, `clients`.`name`, `clients`.`address`, `clients`.`phone`, `clients`.`subscription_fees`, `counters`.`number` as `cnumber`, `consumptions`.`month`, `consumptions`.`year`, `consumptions`.`value`, `invoices`.`id`, `invoices`.`number` as `inumber`, `invoices`.`price`, `payments`.`total_price`, `payments`.`pinality_date`, `payments`.`pinality_price` from `clients` inner join `counters` on `clients`.`id` = `counters`.`client_id` inner join `consumptions` on `counters`.`id` = `consumptions`.`counter_id` inner join `invoices` on `consumptions`.`id` = `invoices`.`consumption_id` inner join `invo_payments` on `invoices`.`id` = `invo_payments`.`invoice_id` inner join `payments` on `invo_payments`.`payment_id` = `payments`.`id` where `payments`.`id` = '739'