app/User.php

    static function getAllUsers($page = 1, $perPage = 15, $searchField = ''){
        $startAt = $perPage * ($page - 1);
        if($searchField == ''){
          $records =  DB::table('users')->get();
          $data['totalPages'] = ceil(count($records) / $perPage);
          $data['result'] = DB::table('users')
          ->offset($startAt)
          ->limit($perPage)->get();
---
select * from `users`
select * from `users` limit 15 offset 0