app/Http/Controllers/CounterController.php

select * from `clients`
---
    public function add(Request $request){
      $status = '';
      $message = '';
      $clients = Client::all();

select * from `clients`
---
    public function edit(Request $request){
      $counter = Counter::findOrFail($request->input('id'));
      $clients = Client::all();